# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Imran\Dropbox\Projects\Shazbot\PSoC\pwmUartFirmware\pwmUartFirmware.cydsn\pwmUartFirmware.cyprj
# Date: Sun, 27 Jul 2014 21:32:37 GMT
#set_units -time ns
create_clock -name {usbUART115200bps_SCBCLK(FFB)} -period 708.33333333333326 -waveform {0 354.166666666667} [list [get_pins {ClockBlock/ff_div_2}]]
create_clock -name {CyHFCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk}]]
create_generated_clock -name {usbUART115200bps_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 17 35} -nominal_period 708.33333333333326 [list]
create_generated_clock -name {CLOCK_LEFT} -source [get_pins {ClockBlock/hfclk}] -edges {1 401 801} -nominal_period 16666.666666666664 [list [get_pins {ClockBlock/udb_div_1}]]
create_generated_clock -name {CLOCK_ThreadClock} -source [get_pins {ClockBlock/hfclk}] -edges {1 24001 48001} [list [get_pins {ClockBlock/udb_div_2}]]
create_generated_clock -name {CLOCK_RIGHT} -source [get_pins {ClockBlock/hfclk}] -edges {1 401 801} -nominal_period 16666.666666666664 [list [get_pins {ClockBlock/udb_div_3}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CySYSCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/sysclk}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]


# Component constraints for C:\Users\Imran\Dropbox\Projects\Shazbot\PSoC\pwmUartFirmware\pwmUartFirmware.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Imran\Dropbox\Projects\Shazbot\PSoC\pwmUartFirmware\pwmUartFirmware.cydsn\pwmUartFirmware.cyprj
# Date: Sun, 27 Jul 2014 21:32:25 GMT
